socialNetwork/rebuttal_results/c5.large/sn_large_r600.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3405.576ms, rate sampling interval: 11427ms
  Thread calibration: mean lat.: 3318.811ms, rate sampling interval: 11132ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.30s     4.68s   22.90s    56.64%
    Req/Sec   197.12     10.52   210.00     62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.61s 
 75.000%   19.48s 
 90.000%   21.23s 
 99.000%   22.90s 
 99.900%   24.02s 
 99.990%   24.25s 
 99.999%   24.28s 
100.000%   24.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5992.447     0.000000            1         1.00
    8437.759     0.100000         1993         1.11
   10207.231     0.200000         3987         1.25
   12353.535     0.300000         5983         1.43
   14196.735     0.400000         7970         1.67
   15605.759     0.500000         9969         2.00
   16343.039     0.550000        10966         2.22
   17219.583     0.600000        11954         2.50
   18055.167     0.650000        12963         2.86
   18726.911     0.700000        13963         3.33
   19480.575     0.750000        14966         4.00
   19890.175     0.775000        15459         4.44
   20185.087     0.800000        15965         5.00
   20430.847     0.825000        16465         5.71
   20676.607     0.850000        16952         6.67
   20987.903     0.875000        17441         8.00
   21118.975     0.887500        17709         8.89
   21233.663     0.900000        17945        10.00
   21430.271     0.912500        18192        11.43
   21577.727     0.925000        18431        13.33
   21839.871     0.937500        18692        16.00
   21921.791     0.943750        18812        17.78
   22003.711     0.950000        18943        20.00
   22102.015     0.956250        19074        22.86
   22200.319     0.962500        19182        26.67
   22282.239     0.968750        19308        32.00
   22331.391     0.971875        19384        35.56
   22380.543     0.975000        19431        40.00
   22446.079     0.978125        19501        45.71
   22495.231     0.981250        19555        53.33
   22659.071     0.984375        19612        64.00
   22740.991     0.985938        19649        71.11
   22790.143     0.987500        19682        80.00
   22855.679     0.989062        19712        91.43
   22953.983     0.990625        19737       106.67
   23134.207     0.992188        19770       128.00
   23183.359     0.992969        19784       142.22
   23314.431     0.993750        19799       160.00
   23396.351     0.994531        19815       182.86
   23543.807     0.995313        19831       213.33
   23642.111     0.996094        19851       256.00
   23658.495     0.996484        19856       284.44
   23707.647     0.996875        19862       320.00
   23756.799     0.997266        19869       365.71
   23855.103     0.997656        19877       426.67
   23937.023     0.998047        19885       512.00
   23969.791     0.998242        19888       568.89
   23986.175     0.998437        19893       640.00
   24002.559     0.998633        19899       731.43
   24018.943     0.998828        19903       853.33
   24035.327     0.999023        19904      1024.00
   24068.095     0.999121        19906      1137.78
   24100.863     0.999219        19909      1280.00
   24117.247     0.999316        19911      1462.86
   24133.631     0.999414        19912      1706.67
   24166.399     0.999512        19914      2048.00
   24199.167     0.999561        19915      2275.56
   24215.551     0.999609        19918      2560.00
   24215.551     0.999658        19918      2925.71
   24215.551     0.999707        19918      3413.33
   24231.935     0.999756        19920      4096.00
   24231.935     0.999780        19920      4551.11
   24231.935     0.999805        19920      5120.00
   24231.935     0.999829        19920      5851.43
   24248.319     0.999854        19921      6826.67
   24248.319     0.999878        19921      8192.00
   24248.319     0.999890        19921      9102.22
   24264.703     0.999902        19922     10240.00
   24264.703     0.999915        19922     11702.86
   24264.703     0.999927        19922     13653.33
   24264.703     0.999939        19922     16384.00
   24264.703     0.999945        19922     18204.44
   24281.087     0.999951        19923     20480.00
   24281.087     1.000000        19923          inf
#[Mean    =    15301.063, StdDeviation   =     4683.923]
#[Max     =    24264.704, Total count    =        19923]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22198 requests in 1.00m, 4.55MB read
Requests/sec:    369.92
Transfer/sec:     77.67KB